<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Str;
use Illuminate\Support\Facades\DB;

class DemoSeeder extends Seeder
{
    public function run(): void
    {
        // --- Categories ---
        $categories = [
            ['name' => 'পিঠা', 'image' => 'assets/image/categories/category.png', 'parent_id' => null],
            ['name' => 'আচার', 'image' => 'assets/image/categories/category.png', 'parent_id' => null],
            ['name' => 'নাট্স', 'image' => 'assets/image/categories/category.png', 'parent_id' => null],
           
        ];

        DB::table('categories')->insert($categories);

        // --- Brands ---
        $brands = [
            ['name' => 'গ্রামীণ পিঠা', 'image' => 'assets/image/brands/brands.png'],
            ['name' => 'ঘরোয়া পিঠা', 'image' => 'assets/image/brands/brands.png'],
            ['name' => 'সখের পিঠা', 'image' => 'assets/image/brands/brands.png'],
            ['name' => 'স্বাদের পিঠা', 'image' => 'assets/image/brands/brands.png'],
            
        ];

        DB::table('brands')->insert($brands);

        // --- Customers ---
        $customers = [
            [
                'name' => 'ওয়াসিম মিয়া',
                'phone' => '0123456789',
                'email' => 'john@example.com',
                'address' => 'চর আমলাব, বেলাব, নরসিংদী, ঢাকা, ',
                'city' => 'ঢাকা',
                'zone' => 'নরসিংদী',
                'area' => 'বেলাব',
                'image' => 'assets/image/customars/photo.png',
            ],
            [
                'name' => 'ইঞ্জি: আক্তারুজ্জামান',
                'phone' => '0987654321',
                'email' => 'jane@example.com',
                'address' => 'উত্তর গাবতলি, সঙ্গিতা, নরসিংদী সদর, নরসিংদী, ঢাকা',
                'city' => 'ঢাকা',
                'zone' => 'নরসিংদী ',
                'area' => 'নরসিংদী সদর',
                'image' => 'assets/image/customars/photo.png',
            ],
        ];

        DB::table('customers')->insert($customers);

        // --- Products ---
        $products = [
            [
                'categories_id' => 1,
                'brand_id' => 1,
                'name' => 'নকশি পিঠা',
                'slug' => Str::slug('নকশি পিঠা'),
                'code' => 'P01',
                'description' => '✅ নকশি পিঠা হচ্ছে গ্রাম্য পরিবেশে তৈরি করা একটি শৈল্পিক পিঠা যা শহর অঞ্চলে দেখা যায় না বললেই চলে
💥 ব্যস্ততার কারণে এখন অনেকেই আছে পিঠাগুলো এখন তৈরি করতে পারছে না তাই পৌঁছে দেওয়া আপনাদের জন্য নিয়ে এসেছে নরম মুচমুচে ঐতিহ্যবাহী এই নকশী পিঠাগুলো 

🔰 আমাদের পিঠাগুলো অত্যন্ত সুস্বাদু ও মজাদারও মুচমুচে আপনি নিশ্চিন্তে অর্ডার করতে পারেন 

🔰 আমাদের পিঠাগুলো ।
১০০% কেমিকেল মুক্ত
১০০% Raw
১০০% অর্গানিক
☎ বিস্তারিত জানতে আমাদের পেজে মেসেজ করুন অথবা ফোন করুনঃ
📳 01716342167

👉 রিভিউ দিন ( এখানে ক্লিক করুন ) আপনার রিভিউ বা মতামত আমাদের নিকট অতি গুরুত্বপূর্ন',
                'old_price' => 690,
                'new_price' => 590,
                'stock' => 10,
                'thumbnail_image' => 'assets/image/products/product.png',
                'feature_image' => 'iphone15_feature.jpg',
                'status' => true,
            ],
            [
                'categories_id' => 1,
                'brand_id' => 1,
                'name' => 'ঝিনুক পিঠা',
                'slug' => Str::slug('ঝিনুক পিঠা'),
                'code' => 'P02',
                'description' => '✅ খুবই সফট ও নরম মুচমুচে ঝিনুক পিঠা হচ্ছে গ্রামীন ঐতিহ্যের প্রতিক ও একটি শৈল্পিক পিঠা যা শহর অঞ্চলে দেখা যায় না বললেই চলে. ⚡ প্রতিটি কামড়ে একটি গল্প বলে.

💥 ঝিনুক পিঠা দেখতে যেমন সুন্দর. খেতে আরোও মজাদার. কিন্তু এটাই সত্যি যে ব্যস্ততার কারণে এখন অনেকেই আছে পিঠাগুলো এখন তৈরি করতে পারছে না তাই গ্রামীন ঐতিহ্য আপনাদের জন্য নিয়ে এসেছে নরম মুচমুচে ঐতিহ্যবাহী এই খুবই সফট নরম ঝিনুক পিঠাগুলো 

🔰 আমাদের পিঠাগুলো অত্যন্ত সুস্বাদু ও মজাদারও মুচমুচে আপনি নিশ্চিন্তে অর্ডার করতে পারেন',
                'old_price' => 690,
                'new_price' => 590,
                'stock' => 20,
                'thumbnail_image' => 'assets/image/products/product.png',
                'feature_image' => 'hp_spectre_feature.jpg',
                'status' => true,
            ],
            [
                'categories_id' => 2,
                'brand_id' => 2,
                'name' => 'রসুনের আচার',
                'slug' => Str::slug('রসুনের আচার'),
                'code' => 'P03',
                'description' => '🧄🌶️ রসুনের আচার - শুধু স্বাদেই নয়, উপকারিতায়ও ভরপুর! 🌶️🧄
"স্বাদে ঘ্রাণে মন ভরে যায়, শরীর ভালো থাকে!"
ঘরেই বানানো, খাঁটি রসুনের আচার এখন আপনার হাতের নাগালে! 😋
কোনো কেমিক্যাল নয়, কোনো প্রিজারভেটিভ নয় — শুধুই খাঁটি উপাদান আর মায়ের মমতা! ❤️ efoodis.com',
                'old_price' => 690,
                'new_price' => 590,
                'stock' => 12,
                'thumbnail_image' => 'assets/image/products/product.png',
                'feature_image' => 'nike_airmax_feature.jpg',
                'status' => true,
            ],
        ];

        DB::table('products')->insert($products);

        // --- Orders ---







        $orders = [
            [
                'customer_id' => 1,
                'invoice' => 'INV-' . strtoupper(Str::random(6)),
                'delivary' => '60',
                'amount' => '590',
                'payment' => 'Cash-On-Delivary',
                'status' => 'pending',
            ],
            [
                'customer_id' => 2,
                'invoice' => 'INV-' . strtoupper(Str::random(6)),
                'delivary' => '120',
                'amount' => '1180',
                'payment' => 'Bkash',
                'status' => 'completed',
            ],
        ];

        DB::table('orders')->insert($orders);



 $order_items = [
            [
                'order_id' => 1,
                'name' => 'নকশি পিঠা',
                'image' => 'assets/image/products/product.png',
                'quantity' => 1 ,
                'price' => 590,
                'amount' => 590,
                
            ], 
            [
                'order_id' => 2,
                'name' => 'নকশি পিঠা',
                'image' => 'assets/image/products/product.png',
                'quantity' => 2 ,
                'price' => 590,
                'amount' => 1180,
                
            ], 
            
        ];
            DB::table('order_items')->insert($order_items);




         $settings = [
            [
                'name' => 'eFoodis.com',
                'phone' => '01828509632',
                'email' => 'efoodis24@gmail.com' ,
                'address' => 'Dhaka Bangladesh',
                'logo' => 'assets/image/companies/logo.png',
                'favicon' => 'assets/image/companies/favicon.png',
            ], 
        ];
            DB::table('settings')->insert($settings);

         $osinfos = [
            [
                'type' => 'indhaka',
                'value' => '60',
            ], 
            [
                'type' => 'outdhaka',
                'value' => '120',
            ], 
            [
                'type' => 'facebook',
                'value' => 'www.facebook.com',
            ], 
            [
                'type' => 'youtube',
                'value' => 'www.youtube.com',
            ], 
            [
                'type' => 'linkedin',
                'value' => 'www.linkedin.com',
            ], 
             
        ];
            DB::table('osinfos')->insert($osinfos);


    }
}
